[
  {
    "word": "aircraft carrier",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A warship designed to carry aircraft, serving as a seagoing air base, with a deck on which aircraft can be launched and landed."
    },
    "difficulty": "HARD"
  },
  {
    "word": "airplane",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A powered heavier-than-air aircraft with fixed wings."
    },
    "difficulty": "EASY"
  },
  {
    "word": "alarm clock",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A clock with an alarm that can be set to sound at a determined time."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "ambulance",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An emergency vehicle designed for transporting seriously ill or injured people to a hospital."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "angel",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An incorporeal and sometimes divine messenger from a deity, or other divine entity, often depicted in art as a youthful winged figure in flowing robes."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "animal migration",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The seasonal movement of animals from one place to another in search of food "
    },
    "difficulty": "HARD"
  },
  {
    "word": "ant",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of various insects in the family Formicidae in the order Hymenoptera, typically living in large colonies composed almost entirely of flightless females."
    },
    "difficulty": "EASY"
  },
  {
    "word": "anvil",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A heavy iron block used in the blacksmithing trade as a surface upon which metal can be struck and shaped."
    },
    "difficulty": "EASY"
  },
  {
    "word": "apple",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A common, round fruit produced by the tree Malus domestica, cultivated in temperate climates."
    },
    "difficulty": "EASY"
  },
  {
    "word": "arm",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The portion of the upper human appendage, from the shoulder to the wrist and sometimes including the hand."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "asparagus",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of various perennial plants of the genus Asparagus having leaflike stems, scalelike leaves, and small flowers."
    },
    "difficulty": "HARD"
  },
  {
    "word": "axe",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A tool for felling trees or chopping wood etc. consisting of a heavy head flattened to a blade on one side, and a handle attached to it."
    },
    "difficulty": "EASY"
  },
  {
    "word": "backpack",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A knapsack, sometimes mounted on a light frame, but always supported by straps, worn on a person’s back for the purpose of carrying things, especially when hiking, or on a student's back when carrying books."
    },
    "difficulty": "EASY"
  },
  {
    "word": "banana",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An elongated curved tropical fruit that grows in bunches and has a creamy flesh and a smooth skin."
    },
    "difficulty": "EASY"
  },
  {
    "word": "bandage",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A strip of gauze or similar material used to protect or support a wound or injury."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "barn",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A building, often found on a farm, used for storage or keeping animals such as cattle."
    },
    "difficulty": "HARD"
  },
  {
    "word": "baseball",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A sport common in North America, the Caribbean, and Japan, in which the object is to strike a ball so that one of a nine-person team can run counter-clockwise among four bases, resulting in the scoring of a run. The team with the most runs after termination of play, usually nine innings, wins."
    },
    "difficulty": "HARD"
  },
  {
    "word": "baseball bat",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "basket",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A lightweight container, generally round, open at the top, and tapering toward the bottom."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "basketball",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A sport in which two opposing teams of five players strive to put a ball through a hoop."
    },
    "difficulty": "HARD"
  },
  {
    "word": "bat",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of the flying mammals of the order Chiroptera, usually small and nocturnal, insectivorous or frugivorous."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "bathtub",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A large container for holding water in which a person may bathe (take a bath)."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "beach",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The shore of a body of water, especially when sandy or pebbly."
    },
    "difficulty": "HARD"
  },
  {
    "word": "bear",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A large omnivorous mammal, related to the dog and raccoon, having shaggy hair, a very small tail, and flat feet; a member of family Ursidae."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "beard",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Facial hair on the chin, cheeks, jaw and neck."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "bed",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A piece of furniture, usually flat and soft, on which to rest or sleep."
    },
    "difficulty": "EASY"
  },
  {
    "word": "bee",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A flying insect, of the clade Anthophila within the hymenopteran superfamily Apoidea, known for its organised societies (though only a minority have them), for collecting pollen and (in some species) producing wax and honey."
    },
    "difficulty": "EASY"
  },
  {
    "word": "belt",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A band worn around the waist to hold clothing to one's body (usually pants), hold weapons (such as a gun or sword), or serve as a decorative piece of clothing."
    },
    "difficulty": "EASY"
  },
  {
    "word": "bench",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A long seat with or without a back, found for example in parks and schools."
    },
    "difficulty": "EASY"
  },
  {
    "word": "bicycle",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A vehicle that has two wheels, one behind the other, a steering handle, and a saddle seat or seats and is usually propelled by the action of a rider’s feet upon pedals."
    },
    "difficulty": "EASY"
  },
  {
    "word": "binoculars",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A hand-held device consisting of a series of lenses and prisms, used to magnify objects so that they can be better seen from a distance, and looked at through both eyes."
    },
    "difficulty": "EASY"
  },
  {
    "word": "bird",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A member of the class of animals Aves in the phylum Chordata, characterized by being warm-blooded, having feathers and wings usually capable of flight, and laying eggs."
    },
    "difficulty": "EASY"
  },
  {
    "word": "birthday cake",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "EASY"
  },
  {
    "word": "blackberry",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A fruit-bearing shrub of the species Rubus fruticosus and some hybrids."
    },
    "difficulty": "HARD"
  },
  {
    "word": "blueberry",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An edible round berry, belonging to the cowberry group (Vaccinium sect. Cyanococcus), with flared crowns at the end, that turns blue on ripening."
    },
    "difficulty": "HARD"
  },
  {
    "word": "book",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A collection of sheets of paper bound together to hinge at one edge, containing printed or written material, pictures, etc."
    },
    "difficulty": "EASY"
  },
  {
    "word": "boomerang",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A flat curved airfoil, that spins about an axis perpendicular to the direction of flight, that was originally used in various parts of the world as hunting weapons or, in returnable types, for sports or training."
    },
    "difficulty": "EASY"
  },
  {
    "word": "bottlecap",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "EASY"
  },
  {
    "word": "bowtie",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A man's necktie tied in a bow around the throat."
    },
    "difficulty": "EASY"
  },
  {
    "word": "bracelet",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A band or chain worn around the wrist as jewelry/jewellery or an ornament."
    },
    "difficulty": "EASY"
  },
  {
    "word": "brain",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The control center of the central nervous system of an animal located in the skull which is responsible for perception, cognition, attention, memory, emotion, and action."
    },
    "difficulty": "EASY"
  },
  {
    "word": "bread",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A foodstuff made by baking dough made from cereals."
    },
    "difficulty": "EASY"
  },
  {
    "word": "bridge",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A construction or natural feature that spans a divide."
    },
    "difficulty": "EASY"
  },
  {
    "word": "broccoli",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A plant, Brassica oleracea var. italica, of the cabbage family, Brassicaceae; especially, the tree-shaped flower and stalk that are eaten as a vegetable."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "broom",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A domestic utensil with fibers bound together at the end of a long handle, used for sweeping."
    },
    "difficulty": "EASY"
  },
  {
    "word": "bucket",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A container made of rigid material, often with a handle, used to carry liquids or small items."
    },
    "difficulty": "EASY"
  },
  {
    "word": "bulldozer",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A tractor with an attached blade for pushing earth and building debris for coarse preliminary surface grading, demolishing building structures, etc."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "bus",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A motor vehicle for transporting large numbers of people along roads."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "bush",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A woody plant distinguished from a tree by its multiple stems and lower height, being usually less than six metres tall; a horticultural rather than strictly botanical category."
    },
    "difficulty": "EASY"
  },
  {
    "word": "butterfly",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A flying insect of the order Lepidoptera, distinguished from moths by their diurnal activity and generally brighter colouring."
    },
    "difficulty": "EASY"
  },
  {
    "word": "cactus",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any member of the family Cactaceae, a family of flowering New World succulent plants suited to a hot, semi-desert climate."
    },
    "difficulty": "EASY"
  },
  {
    "word": "cake",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A rich, sweet dessert food, typically made of flour, sugar and eggs and baked in an oven, and often covered in icing."
    },
    "difficulty": "EASY"
  },
  {
    "word": "calculator",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A mechanical or electronic device that performs mathematical calculations."
    },
    "difficulty": "EASY"
  },
  {
    "word": "calendar",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any system by which time is divided into days, weeks, months, and years."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "camel",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A beast of burden, much used in desert areas, of the genus Camelus."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "camera",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A device for taking still or moving pictures or photographs."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "camouflage",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A disguise or covering up."
    },
    "difficulty": "HARD"
  },
  {
    "word": "campfire",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A fire at a campground or on a camping trip, often used for cooking, to provide light and heat, to drive away bugs, and as a focal point for sitting around in the evening and talking, telling stories, and singing."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "candle",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A light source consisting of a wick embedded in a solid, flammable substance such as wax, tallow, or paraffin."
    },
    "difficulty": "EASY"
  },
  {
    "word": "cannon",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A complete assembly, consisting of an artillery tube and a breech mechanism, firing mechanism or base cap, which is a component of a gun, howitzer or mortar. It may include muzzle appendages."
    },
    "difficulty": "EASY"
  },
  {
    "word": "canoe",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A small long and narrow boat, propelled by one or more people (depending on the size of canoe), using single-bladed paddles. The paddlers face in the direction of travel, in either a seated position, or kneeling on the bottom of the boat. Canoes are open on top, and pointed at both ends."
    },
    "difficulty": "EASY"
  },
  {
    "word": "car",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A wheeled vehicle that moves independently, with at least three wheels, powered mechanically, steered by a driver and mostly for personal transportation."
    },
    "difficulty": "EASY"
  },
  {
    "word": "carrot",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A vegetable with a nutritious, juicy, sweet root that is often orange in colour, Daucus carota, especially the subspecies sativus in the family Apiaceae."
    },
    "difficulty": "EASY"
  },
  {
    "word": "castle",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A large building that is fortified and contains many defences; in previous ages often inhabited by a nobleman or king."
    },
    "difficulty": "EASY"
  },
  {
    "word": "cat",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An animal of the family Felidae:"
    },
    "difficulty": "EASY"
  },
  {
    "word": "ceiling fan",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "cello",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A large stringed instrument of the violin family with four strings, tuned from lowest to highest C-G-D-A, and played with a bow, also possessing an endpin to support the instrument's weight."
    },
    "difficulty": "HARD"
  },
  {
    "word": "cell phone",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A portable, wireless telephone, which changes antenna connections seamlessly during travel from one radio reception cell to another without losing the party-to-party call connection."
    },
    "difficulty": "HARD"
  },
  {
    "word": "chair",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An item of furniture used to sit on or in, comprising a seat, legs, back, and sometimes arm rests, for use by one person. Compare stool, couch, sofa, settee, loveseat and bench."
    },
    "difficulty": "EASY"
  },
  {
    "word": "chandelier",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A branched, often ornate, lighting fixture suspended from the ceiling"
    },
    "difficulty": "EASY"
  },
  {
    "word": "church",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A Christian house of worship; a building where Christian religious services take place."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "circle",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A two-dimensional geometric figure, a line, consisting of the set of all those points in a plane that are equally distant from a given point (center)."
    },
    "difficulty": "EASY"
  },
  {
    "word": "clarinet",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A woodwind musical instrument that has a distinctive liquid tone whose characteristics vary among its three registers: chalumeau (low), clarion (medium), and altissimo (high)."
    },
    "difficulty": "HARD"
  },
  {
    "word": "clock",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An instrument used to measure or keep track of time; a non-portable timepiece."
    },
    "difficulty": "EASY"
  },
  {
    "word": "cloud",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A rock; boulder; a hill."
    },
    "difficulty": "EASY"
  },
  {
    "word": "coffee cup",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A cup, typically a small one, in which coffee can be served."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "compass",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A magnetic or electronic device used to determine the cardinal directions (usually magnetic or true north)."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "computer",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A person employed to perform computations; one who computes."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "cookie",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A small, flat, baked good which is either crisp or soft but firm."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "cooler",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An insulated bin or box used with ice or freezer packs to keep food or beverages cold while picnicking or camping."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "couch",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Couch grass, a species of persistent grass, Elymus repens, usually considered a weed."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "cow",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "(properly) An adult female of the species Bos taurus, especially one that has calved."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "crab",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A crustacean of the infraorder Brachyura, having five pairs of legs, the foremost of which are in the form of claws, and a carapace."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "crayon",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A stick of colored chalk or wax used for drawing."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "crocodile",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of the predatory amphibious reptiles of the family Crocodylidae; a crocodilian, any species of the order Crocodilia, which also includes the alligators, caimans and gavials."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "crown",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A royal, imperial or princely headdress; a diadem."
    },
    "difficulty": "EASY"
  },
  {
    "word": "cruise ship",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A passenger ship used for pleasure voyages, where the voyage itself and the ship's amenities are considered an essential part of the experience."
    },
    "difficulty": "HARD"
  },
  {
    "word": "cup",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A concave vessel for drinking from, usually made of opaque material (as opposed to a glass) and with a handle."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "diamond",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A glimmering glass-like mineral that is an allotrope of carbon in which each atom is surrounded by four others in the form of a tetrahedron."
    },
    "difficulty": "EASY"
  },
  {
    "word": "dishwasher",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A machine for washing dishes."
    },
    "difficulty": "HARD"
  },
  {
    "word": "diving board",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A springboard used for diving into water."
    },
    "difficulty": "HARD"
  },
  {
    "word": "dog",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A mammal, Canis familiaris or Canis lupus familiaris, that has been domesticated for thousands of years, of highly variable appearance due to human breeding."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "dolphin",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A carnivorous aquatic mammal in one of several families of order Cetacea, famed for its intelligence and occasional willingness to approach humans."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "donut",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A deep-fried piece of dough or batter, commonly made in a toroidal or ellipsoidal shape, and mixed with various sweeteners and flavors, sometimes filled with jelly, custard or cream."
    },
    "difficulty": "EASY"
  },
  {
    "word": "door",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A portal of entry into a building, room, or vehicle, consisting of a rigid plane movable on a hinge. Doors are frequently made of wood or metal. May have a handle to help open and close, a latch to hold the door closed and a lock that ensures the door cannot be opened without the key."
    },
    "difficulty": "EASY"
  },
  {
    "word": "dragon",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A legendary serpentine or reptilian creature."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "dresser",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An item of kitchen furniture, like a cabinet with shelves, for storing crockery or utensils."
    },
    "difficulty": "HARD"
  },
  {
    "word": "drill",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A tool used to remove material so as to create a hole, typically by plunging a rotating cutting bit into a stationary workpiece."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "drums",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A percussive musical instrument spanned with a thin covering on at least one end for striking, forming an acoustic chamber, affecting what materials are used to make it; a membranophone."
    },
    "difficulty": "EASY"
  },
  {
    "word": "duck",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An aquatic bird of the family Anatidae, having a flat bill and webbed feet."
    },
    "difficulty": "EASY"
  },
  {
    "word": "dumbbell",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A weight training implement consisting of a short bar with weight counterpoised on each end."
    },
    "difficulty": "EASY"
  },
  {
    "word": "ear",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The organ of hearing, consisting of the pinna, auditory canal, eardrum, malleus, incus, stapes and cochlea."
    },
    "difficulty": "EASY"
  },
  {
    "word": "elbow",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The joint between the upper arm and the forearm."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "elephant",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A mammal of the order Proboscidea, having a trunk, and two large ivory tusks jutting from the upper jaw."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "envelope",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A paper or cardboard wrapper used to enclose small, flat items, especially letters, for mailing."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "eraser",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "One who erases."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "eye",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An organ through which animals see (perceive surroundings via light)."
    },
    "difficulty": "EASY"
  },
  {
    "word": "eyeglasses",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An artificial lens, especially one of a pair."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "face",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The front part of the head of a human or other animal, featuring the eyes, nose and mouth, and the surrounding area."
    },
    "difficulty": "EASY"
  },
  {
    "word": "fan",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A hand-held device consisting of concertinaed material, or slats of material, gathered together at one end, that may be opened out into the shape of a sector of a circle and waved back and forth in order to move air towards oneself and cool oneself."
    },
    "difficulty": "EASY"
  },
  {
    "word": "feather",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A branching, hair-like structure that grows on the bodies of birds, used for flight, swimming, protection and display."
    },
    "difficulty": "EASY"
  },
  {
    "word": "fence",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A thin artificial barrier that separates two pieces of land or a house perimeter."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "finger",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A slender jointed extremity of the human hand, exclusive of the thumb."
    },
    "difficulty": "EASY"
  },
  {
    "word": "fire hydrant",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A device used by firefighters to obtain water from the main supply, consisting of a barrel, connections for hose and a valve assembly."
    },
    "difficulty": "EASY"
  },
  {
    "word": "fireplace",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An open hearth for holding a fire at the base of a chimney."
    },
    "difficulty": "EASY"
  },
  {
    "word": "firetruck",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A vehicle equipped with fire fighting apparatus"
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "fish",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A cold-blooded vertebrate animal that lives in water, moving with the help of fins and breathing with gills."
    },
    "difficulty": "EASY"
  },
  {
    "word": "flamingo",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A wading bird of the family Phoenicopteridae."
    },
    "difficulty": "HARD"
  },
  {
    "word": "flashlight",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A battery-powered hand-held light source."
    },
    "difficulty": "EASY"
  },
  {
    "word": "flip flops",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "HARD"
  },
  {
    "word": "floor lamp",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A lamp supported by a tall vertical pole in order that light comes from above those seated in the vicinity."
    },
    "difficulty": "HARD"
  },
  {
    "word": "flower",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A colorful, conspicuous structure associated with angiosperms, frequently scented and attracting various insects, and which may or may not be used for sexual reproduction."
    },
    "difficulty": "EASY"
  },
  {
    "word": "flying saucer",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An unidentified flying object; UFO; usually with disc-like properties."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "foot",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A biological structure found in many animals that is used for locomotion and that is frequently a separate organ at the terminal part of the leg."
    },
    "difficulty": "EASY"
  },
  {
    "word": "fork",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A pronged tool having a long straight handle, used for digging, lifting, throwing etc."
    },
    "difficulty": "EASY"
  },
  {
    "word": "frog",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A small tailless amphibian of the order Anura that typically hops."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "frying pan",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A long-handled, shallow pan used for frying food."
    },
    "difficulty": "HARD"
  },
  {
    "word": "garden",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An outdoor area containing one or more types of plants, usually plants grown for food or ornamental purposes."
    },
    "difficulty": "HARD"
  },
  {
    "word": "garden hose",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "HARD"
  },
  {
    "word": "giraffe",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A ruminant, of the genus Giraffa, of the African savannah with long legs and highly elongated neck, which make it the tallest living animal; yellow fur patterned with dark spots, often in the form of a network; and two or more short, skin-covered horns, so-called; strictly speaking the horn-like projections are ossicones."
    },
    "difficulty": "EASY"
  },
  {
    "word": "goatee",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A beard trimmed to grow only at the center of the chin."
    },
    "difficulty": "HARD"
  },
  {
    "word": "golf club",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "In golf, the implement used to hit the golf ball."
    },
    "difficulty": "HARD"
  },
  {
    "word": "grapes",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A small, round, smooth-skinned edible fruit, usually purple, red, or green, that grows in bunches on vines of genus Vitis."
    },
    "difficulty": "EASY"
  },
  {
    "word": "grass",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any plant of the family Poaceae, characterized by leaves that arise from nodes in the stem and leaf bases that wrap around the stem, especially those grown as ground cover rather than for grain."
    },
    "difficulty": "EASY"
  },
  {
    "word": "guitar",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A stringed musical instrument, of European origin, usually with a fretted fingerboard and six strings, played with the fingers or a plectrum (guitar pick)."
    },
    "difficulty": "EASY"
  },
  {
    "word": "hamburger",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A hot sandwich consisting of a patty of cooked ground beef or a meat substitute, in a sliced bun, sometimes also containing salad vegetables, condiments, or both."
    },
    "difficulty": "EASY"
  },
  {
    "word": "hammer",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A tool with a heavy head and a handle used for pounding."
    },
    "difficulty": "EASY"
  },
  {
    "word": "hand",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The part of the forelimb below the forearm or wrist in a human, and the corresponding part in many other animals."
    },
    "difficulty": "EASY"
  },
  {
    "word": "harp",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A musical instrument consisting of a body and a curved neck, strung with strings of varying length that are stroked or plucked with the fingers and are vertical to the soundboard when viewed from the end of the body"
    },
    "difficulty": "EASY"
  },
  {
    "word": "hat",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A covering for the head, often in the approximate form of a cone or a cylinder closed at its top end, and sometimes having a brim and other decoration."
    },
    "difficulty": "EASY"
  },
  {
    "word": "headphones",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A pair of speakers worn over or in the ears so only the wearer can hear the sound."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "hedgehog",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A small mammal, of the family Erinaceidae or subfamily Erinaceinae (spiny hedgehog, the latter characterized by their spiny back and often by the habit of rolling up into a ball when attacked.)"
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "helicopter",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An aircraft that is borne along by one or more sets of long rotating blades which allow it to hover, move in any direction including reverse, or land; and typically having a smaller set of blades on its tail that stabilize the aircraft."
    },
    "difficulty": "EASY"
  },
  {
    "word": "helmet",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A protective head covering, usually part of armour."
    },
    "difficulty": "HARD"
  },
  {
    "word": "hexagon",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A polygon with six sides and six angles."
    },
    "difficulty": "EASY"
  },
  {
    "word": "hockey puck",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "HARD"
  },
  {
    "word": "hockey stick",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A stick used to handle the puck in ice hockey, having a flat, angled blade at the end."
    },
    "difficulty": "HARD"
  },
  {
    "word": "horse",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of several animals related to Equus ferus caballus."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "hospital",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A large medical facility, usually in a building with multiple floors, where seriously ill or injured patients are given extensive medical and/or surgical treatment."
    },
    "difficulty": "HARD"
  },
  {
    "word": "hot air balloon",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "EASY"
  },
  {
    "word": "hot dog",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A sandwich consisting of a frankfurter, or wiener, in a bread roll, usually served with ketchup, mustard, relish, etc."
    },
    "difficulty": "EASY"
  },
  {
    "word": "hot tub",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A large tub, often situated outdoors, filled with hot water and used for communal leisure bathing."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "hourglass",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A clock made of two glass vessels connected by a narrow passage through which sand flows."
    },
    "difficulty": "EASY"
  },
  {
    "word": "house",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A structure built or serving as an abode of human beings."
    },
    "difficulty": "EASY"
  },
  {
    "word": "house plant",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A plant that is grown indoors in places such as a house or office for decorative purposes."
    },
    "difficulty": "HARD"
  },
  {
    "word": "hurricane",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A severe tropical cyclone in the North Atlantic Ocean, Caribbean Sea, Gulf of Mexico, or in the eastern North Pacific off the west coast of Mexico, with winds of 119 km/h (74 miles per hour) or greater accompanied by rain, lightning, and thunder that sometimes moves into temperate latitudes."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "ice cream",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A dessert made from frozen sweetened cream or a similar substance, usually flavoured."
    },
    "difficulty": "EASY"
  },
  {
    "word": "jacket",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A piece of clothing worn on the upper body outside a shirt or blouse, often waist length to thigh length."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "jail",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A place or institution for the confinement of persons held in lawful custody or detention, especially for minor offenses or with reference to some future judicial proceeding."
    },
    "difficulty": "HARD"
  },
  {
    "word": "kangaroo",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A member of the Macropodidae family of large marsupials with strong hind legs for hopping, native to Australia."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "key",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An object designed to open and close a lock."
    },
    "difficulty": "EASY"
  },
  {
    "word": "keyboard",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "(etc.) A set of keys used to operate a typewriter, computer etc."
    },
    "difficulty": "EASY"
  },
  {
    "word": "knee",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "In humans, the joint or the region of the joint in the middle part of the leg between the thigh and the shank."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "knife",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A utensil or a tool designed for cutting, consisting of a flat piece of hard material, usually steel or other metal (the blade), usually sharpened on one edge, attached to a handle. The blade may be pointed for piercing."
    },
    "difficulty": "EASY"
  },
  {
    "word": "ladder",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A frame, usually portable, of wood, metal, or rope, used for ascent and descent, consisting of two side pieces to which are fastened rungs (cross strips or rounds acting as steps)."
    },
    "difficulty": "EASY"
  },
  {
    "word": "lantern",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A case of translucent or transparent material made to protect a flame, or light, used to illuminate its surroundings."
    },
    "difficulty": "EASY"
  },
  {
    "word": "laptop",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A laptop computer."
    },
    "difficulty": "HARD"
  },
  {
    "word": "leaf",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The usually green and flat organ that represents the most prominent feature of most vegetative plants."
    },
    "difficulty": "EASY"
  },
  {
    "word": "leg",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A limb or appendage that an animal uses for support or locomotion."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "light bulb",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An evacuated glass bulb containing a metal filament which is heated by electrical resistance to produce light."
    },
    "difficulty": "EASY"
  },
  {
    "word": "lighter",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A small, reusable handheld device for creating fire, especially for lighting cigarettes."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "lighthouse",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A tower or other structure exhibiting a light or lights to warn or guide sailors."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "lightning",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A flash of light produced by short-duration, high-voltage discharge of electricity within a cloud, between clouds, or between a cloud and the earth."
    },
    "difficulty": "EASY"
  },
  {
    "word": "line",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A path through two or more points (compare ‘segment’); a continuous mark, including as made by a pen; any path, curved or straight."
    },
    "difficulty": "EASY"
  },
  {
    "word": "lion",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A big cat, Panthera leo, native to Africa, India and formerly much of Europe."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "lipstick",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Makeup for the lips."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "lobster",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A crustacean of the Nephropidae family, dark green or blue-black in colour turning bright red when cooked, with a hard shell and claws, which is used as a seafood."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "lollipop",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An item of confectionery consisting of a piece of candy/sweet attached to a stick."
    },
    "difficulty": "EASY"
  },
  {
    "word": "mailbox",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A box into which mail is put"
    },
    "difficulty": "EASY"
  },
  {
    "word": "map",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A visual representation of an area, whether real or imaginary."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "marker",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An object used to mark a location."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "matches",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A competitive sporting event such as a boxing meet, a baseball game, or a cricket match."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "megaphone",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A portable, usually hand-held, funnel-shaped device that is used to amplify a person’s natural voice toward a targeted direction."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "mermaid",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A mythological creature with a woman's head and upper body, and a tail of a fish."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "microphone",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A device (transducer) used to convert sound waves into a varying electric current; normally fed into an amplifier and either recorded or broadcast."
    },
    "difficulty": "EASY"
  },
  {
    "word": "microwave",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An electromagnetic wave with wavelength between that of infrared light and radio waves."
    },
    "difficulty": "HARD"
  },
  {
    "word": "monkey",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any member of the clade Simiiformes not also of the clade Hominoidea containing humans and apes, from which they are usually, but not universally, distinguished by smaller size, a tail, and cheek pouches."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "moon",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any natural satellite of a planet."
    },
    "difficulty": "EASY"
  },
  {
    "word": "mosquito",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A small flying insect of the family Culicidae, the females of which bite humans and animals and suck blood, leaving an itching bump on the skin, and sometimes carrying diseases like malaria and yellow fever."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "motorbike",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A motorcycle."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "mountain",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An elevation of land of considerable dimensions rising more or less abruptly, forming a conspicuous figure in the landscape, usually having a small extent of surface at its summit."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "mouse",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any small rodent of the genus Mus."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "moustache",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A growth of facial hair between the nose and the upper lip."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "mouth",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The opening of a creature through which food is ingested."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "mug",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A large cup for hot liquids, usually having a handle and used without a saucer."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "mushroom",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of the fleshy fruiting bodies of fungi typically produced above ground on soil or on their food sources (such as decaying wood)."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "nail",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The thin, horny plate at the ends of fingers and toes on humans and some other animals."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "necklace",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An article of jewelry that is worn around the neck, most often made of a string of precious metal, pearls, gems, beads or shells, and sometimes having a pendant attached."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "nose",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A protuberance on the face housing the nostrils, which are used to breathe or smell."
    },
    "difficulty": "EASY"
  },
  {
    "word": "ocean",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "One of the large bodies of water separating the continents."
    },
    "difficulty": "HARD"
  },
  {
    "word": "octagon",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A polygon with eight sides and eight angles."
    },
    "difficulty": "EASY"
  },
  {
    "word": "octopus",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of several marine molluscs of the family Octopodidae, having no internal or external protective shell or bone (unlike the nautilus, squid and cuttlefish) and eight arms each covered with suckers."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "onion",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A monocotyledonous plant (Allium cepa), allied to garlic, used as vegetable and spice."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "oven",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A chamber used for baking or heating."
    },
    "difficulty": "HARD"
  },
  {
    "word": "owl",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of various birds of prey of the order Strigiformes that are primarily nocturnal and have forward-looking, binocular vision, limited eye movement, and good hearing."
    },
    "difficulty": "HARD"
  },
  {
    "word": "paintbrush",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A thin brush for applying paint."
    },
    "difficulty": "EASY"
  },
  {
    "word": "paint can",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "palm tree",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A tree of the family Arecaceae usually characterised by having a single stem or trunk, directly from which sprout several leaves or fronds giving a shape like an outstretched hand."
    },
    "difficulty": "EASY"
  },
  {
    "word": "panda",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The red panda (Ailurus fulgens), a small raccoon-like animal of northeast Asia with reddish fur and a long, ringed tail."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "pants",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "(Manchester) An outer garment that covers the body from the waist downwards, covering each leg separately, usually as far as the ankles; trousers."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "paper clip",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A small, folded, wire or plastic device used to hold sheets of paper together."
    },
    "difficulty": "EASY"
  },
  {
    "word": "parachute",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A device, generally constructed from fabric, that is designed to employ air resistance to control the fall of an object."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "parrot",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A kind of bird, many species of which are colourful and able to mimic human speech, of the order Psittaciformes or (narrowly) of the family Psittacidae."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "passport",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An official document normally used for international journeys, which proves the identity and nationality of the person for whom it was issued."
    },
    "difficulty": "HARD"
  },
  {
    "word": "peanut",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A legume resembling a nut, the fruit of the plant Arachis hypogaea."
    },
    "difficulty": "EASY"
  },
  {
    "word": "pear",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An edible fruit produced by the pear tree, similar to an apple but elongated towards the stem."
    },
    "difficulty": "EASY"
  },
  {
    "word": "peas",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A plant, Pisum sativum, member of the legume (Fabaceae) family."
    },
    "difficulty": "EASY"
  },
  {
    "word": "pencil",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A paintbrush."
    },
    "difficulty": "EASY"
  },
  {
    "word": "penguin",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of several flightless sea birds, of order Sphenisciformes, found in the Southern Hemisphere, marked by their usual upright stance, walking on short legs, and (generally) their stark black and white plumage."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "piano",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A percussive keyboard musical instrument, usually ranging over seven octaves, with white and black colored keys, played by pressing these keys, causing hammers to strike strings"
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "pickup truck",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A light truck with an open cargo bed."
    },
    "difficulty": "HARD"
  },
  {
    "word": "picture frame",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "pig",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of several intelligent mammalian species of the genus Sus, having cloven hooves, bristles and a nose adapted for digging; especially the domesticated animal Sus scrofa."
    },
    "difficulty": "EASY"
  },
  {
    "word": "pillow",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A soft cushion used to support the head in bed."
    },
    "difficulty": "EASY"
  },
  {
    "word": "pineapple",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A tropical plant, Ananas comosus, native to South America, having thirty or more long, spined and pointed leaves surrounding a thick stem."
    },
    "difficulty": "EASY"
  },
  {
    "word": "pizza",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A baked Italian dish of a thinly rolled bread dough crust typically topped before baking with tomato sauce, cheese and other ingredients such as meat, vegetables or fruit"
    },
    "difficulty": "EASY"
  },
  {
    "word": "pliers",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A pincer-like gripping tool that multiplies the strength of the user's hand, often used for bending things."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "police car",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "HARD"
  },
  {
    "word": "pond",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An inland body of standing water, either natural or man-made, that is smaller than a lake."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "pool",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A small and rather deep collection of (usually) fresh water, as one supplied by a spring, or occurring in the course of a stream; a reservoir for water."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "popsicle",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Frozen fruit juice, flavored sugar water or the like, on a stick, of a size to be one serving."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "postcard",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A rectangular piece of thick paper or thin cardboard intended to be written on and mailed without an envelope. In the case of a picture postcard one side carries a picture or photograph."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "potato",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The tuber of a plant, Solanum tuberosum, eaten as a starchy vegetable, particularly in the Americas and Europe; this plant."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "power outlet",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "purse",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A small bag for carrying money."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "rabbit",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A mammal of the family Leporidae, with long ears, long hind legs and a short, fluffy tail."
    },
    "difficulty": "EASY"
  },
  {
    "word": "raccoon",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A nocturnal omnivore native to North America, typically with a mixture of gray, brown, and black fur, a mask-like marking around the eyes and a striped tail; Procyon lotor."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "radio",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The technology that allows for the transmission of sound or other signals by modulation of electromagnetic waves."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "rain",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Condensed water falling from a cloud."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "rainbow",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A multicoloured arch in the sky, produced by prismatic refraction of light within droplets of rain in the air."
    },
    "difficulty": "EASY"
  },
  {
    "word": "rake",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A garden tool with a row of pointed teeth fixed to a long handle, used for collecting debris, grass, etc., for flattening the ground, or for loosening soil; also, a similar wheel-mounted tool drawn by a horse or a tractor."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "remote control",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A device used to operate an appliance (such as a television), vehicle or mechanical toy from a short distance away."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "rhinoceros",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of several large herbivorous pachyderms native to Africa and Asia of the five extant species in the three extant genera in the family Rhinocerotidae, with thick, gray skin and one or two horns on their snouts."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "rifle",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A shouldered firearm with a long, rifled barrel to improve range and accuracy."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "river",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A large and often winding stream which drains a land mass, carrying water down from higher areas to a lower point, oftentimes ending in another body of water, such as an ocean or in an inland sea."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "roller coaster",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An amusement ride consisting of a buggy on a track that rises, falls, twists and turns."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "rollerskates",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A boot having small wheels or casters attached to its sole; used for roller skating"
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "sailboat",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A boat propelled by a sail."
    },
    "difficulty": "HARD"
  },
  {
    "word": "sandwich",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A dish or foodstuff where two or more slices of bread serve as the wrapper or container of some other food."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "saw",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A tool with a toothed blade used for cutting hard substances, in particular wood or metal"
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "saxophone",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A single-reed instrument musical instrument of the woodwind family, usually made of brass and with a distinctive loop bringing the bell upwards."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "school bus",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "HARD"
  },
  {
    "word": "scissors",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "One blade on a pair of scissors."
    },
    "difficulty": "EASY"
  },
  {
    "word": "scorpion",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of various arachnids of the order Scorpiones, related to the spiders, characterised by two large front pincers and a curved tail with a venomous sting in the end."
    },
    "difficulty": "EASY"
  },
  {
    "word": "screwdriver",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A hand or machine tool which engages with the head of a screw and allows torque to be applied to turn the screw, thus driving it in or loosening it."
    },
    "difficulty": "EASY"
  },
  {
    "word": "sea turtle",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any turtle that inhabits oceans."
    },
    "difficulty": "HARD"
  },
  {
    "word": "see saw",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "HARD"
  },
  {
    "word": "shark",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A scaleless, predatory fish of the superorder Selachimorpha, with a cartilaginous skeleton and 5 to 7 gill slits on each side of its head."
    },
    "difficulty": "HARD"
  },
  {
    "word": "sheep",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A woolly ruminant of the genus Ovis."
    },
    "difficulty": "EASY"
  },
  {
    "word": "shoe",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A protective covering for the foot, with a bottom part composed of thick leather or plastic sole and often a thicker heel, and a softer upper part made of leather or synthetic material. Shoes generally do not extend above the ankle, as opposed to boots, which do."
    },
    "difficulty": "EASY"
  },
  {
    "word": "shorts",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A short circuit."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "shovel",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A hand tool with a handle, used for moving portions of material such as earth, snow, and grain from one place to another, with some forms also used for digging. Not to be confused with a spade, which is designed solely for small-scale digging and incidental tasks such as chopping of small roots."
    },
    "difficulty": "EASY"
  },
  {
    "word": "sink",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A basin used for holding water for washing."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "skateboard",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A narrow, wooden or plastic platform mounted on pairs of wheels, on which one stands and propels oneself by pushing along the ground with one foot."
    },
    "difficulty": "EASY"
  },
  {
    "word": "skull",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The main bones of the head considered as a unit; including the cranium, facial bones, and mandible."
    },
    "difficulty": "EASY"
  },
  {
    "word": "skyscraper",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A very tall building with a large number of floors."
    },
    "difficulty": "HARD"
  },
  {
    "word": "sleeping bag",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A padded or insulated bag large enough to surround the whole body and which keeps the user warm while sleeping, used as a substitute for bedclothes."
    },
    "difficulty": "HARD"
  },
  {
    "word": "smiley face",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A simplified drawing of a smiling face, using two dots for the eyes and an arc for the mouth."
    },
    "difficulty": "EASY"
  },
  {
    "word": "snail",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of very many animals (either hermaphroditic or nonhermaphroditic), of the class Gastropoda, having a coiled shell."
    },
    "difficulty": "EASY"
  },
  {
    "word": "snake",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A legless reptile of the sub-order Serpentes with a long, thin body and a fork-shaped tongue."
    },
    "difficulty": "EASY"
  },
  {
    "word": "snorkel",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A hollow tube, held in the mouth, or mounted on and opening into a diving mask, used by swimmers for breathing underwater."
    },
    "difficulty": "HARD"
  },
  {
    "word": "snowflake",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A crystal of snow, having approximate hexagonal symmetry."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "snowman",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A humanoid figure made with large snowballs stacked on each other. Human traits like a face and arms may be fashioned with sticks (arms), a carrot (nose), and stones or coal (eyes, mouth)."
    },
    "difficulty": "EASY"
  },
  {
    "word": "soccer ball",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "sock",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A knitted or woven covering for the foot."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "speedboat",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A fast boat, usually small (for 1-8 people)."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "spider",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of various eight-legged, predatory arthropods, of the order Araneae, most of which spin webs to catch prey."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "spoon",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An implement for eating or serving; a scooped utensil whose long handle is straight, in contrast to a ladle."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "spreadsheet",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A sheet of paper, marked with a grid, in which financial data is recorded and totals calculated manually."
    },
    "difficulty": "HARD"
  },
  {
    "word": "square",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A polygon with four sides of equal length and four right angles; an equilateral rectangle; a regular quadrilateral."
    },
    "difficulty": "EASY"
  },
  {
    "word": "squiggle",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A short twisting or wiggling line or mark"
    },
    "difficulty": "HARD"
  },
  {
    "word": "squirrel",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of the rodents of the family Sciuridae distinguished by their large bushy tail."
    },
    "difficulty": "HARD"
  },
  {
    "word": "stairs",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A single step in a staircase."
    },
    "difficulty": "EASY"
  },
  {
    "word": "star",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any small luminous dot appearing in the cloudless portion of the night sky, especially with a fixed location relative to other such dots."
    },
    "difficulty": "EASY"
  },
  {
    "word": "steak",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Beefsteak, a slice of beef, broiled or cut for broiling."
    },
    "difficulty": "HARD"
  },
  {
    "word": "stereo",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A system of recording or reproducing sound that uses two channels, each playing a portion of the original sound in such a way as to create the illusion of locating the sound at a particular position, each offset from the other, thereby more accurately imitating the location of the original sound when the recorded or reproduced sound is heard."
    },
    "difficulty": "HARD"
  },
  {
    "word": "stethoscope",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A medical instrument used for listening to sounds produced within the body, often combined with a sphygmomanometer"
    },
    "difficulty": "HARD"
  },
  {
    "word": "stitches",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A single pass of a needle in sewing; the loop or turn of the thread thus made."
    },
    "difficulty": "HARD"
  },
  {
    "word": "stop sign",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "HARD"
  },
  {
    "word": "stove",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A heater, a closed apparatus to burn fuel for the warming of a room."
    },
    "difficulty": "HARD"
  },
  {
    "word": "strawberry",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "The sweet, usually red, edible fruit of certain plants of the genus Fragaria."
    },
    "difficulty": "EASY"
  },
  {
    "word": "streetlight",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any large outdoor light used to illuminate a public area, usually urban."
    },
    "difficulty": "HARD"
  },
  {
    "word": "string bean",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A long, slender variety of green bean."
    },
    "difficulty": "HARD"
  },
  {
    "word": "submarine",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A boat that can go underwater."
    },
    "difficulty": "HARD"
  },
  {
    "word": "suitcase",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A large (usually rectangular) piece of luggage used for carrying clothes, and sometimes suits, when travelling."
    },
    "difficulty": "HARD"
  },
  {
    "word": "sun",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A star, especially when seen as the centre of any single solar system."
    },
    "difficulty": "EASY"
  },
  {
    "word": "swan",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of various species of large, long-necked waterfowl, of genus Cygnus (bird family: Anatidae), most of which have white plumage."
    },
    "difficulty": "EASY"
  },
  {
    "word": "sweater",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A knitted jacket or jersey, usually of thick wool, worn by athletes before or after exercise."
    },
    "difficulty": "HARD"
  },
  {
    "word": "swing set",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "HARD"
  },
  {
    "word": "sword",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A long-bladed weapon with a hilt, and usually a pommel and cross-guard, which is designed to stab, slash, and/or hack."
    },
    "difficulty": "EASY"
  },
  {
    "word": "syringe",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A device used for injecting or drawing fluids through a membrane."
    },
    "difficulty": "EASY"
  },
  {
    "word": "table",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Furniture with a top surface to accommodate a variety of uses."
    },
    "difficulty": "EASY"
  },
  {
    "word": "teapot",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A vessel for brewing and serving tea."
    },
    "difficulty": "EASY"
  },
  {
    "word": "teddy-bear",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A plush toy in the shape of a bear."
    },
    "difficulty": "EASY"
  },
  {
    "word": "telephone",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A telecommunication device (originally mechanical, and now electronic) used for two-way talking with another person (now often shortened to phone)."
    },
    "difficulty": "EASY"
  },
  {
    "word": "television",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An electronic communication medium that allows the transmission of real-time visual images, and often sound."
    },
    "difficulty": "EASY"
  },
  {
    "word": "tennis racquet",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "EASY"
  },
  {
    "word": "tent",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A pavilion or portable lodge consisting of skins, canvas, or some strong cloth, stretched and sustained by poles, used for sheltering people from the weather."
    },
    "difficulty": "EASY"
  },
  {
    "word": "The Eiffel Tower",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "The Great Wall of China",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": ""
    },
    "difficulty": "HARD"
  },
  {
    "word": "The Mona Lisa",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A very famous painting by Leonardo Da Vinci"
    },
    "difficulty": "HARD"
  },
  {
    "word": "tiger",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Panthera tigris, a large predatory mammal of the cat family, indigenous to Asia."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "toaster",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "One who toasts (cooks lightly by browning)."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "toe",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Each of the five digits on the end of the foot."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "toilet",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A covering of linen, silk, or tapestry, spread over a dressing table in a chamber or dressing room."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "tooth",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A hard, calcareous structure present in the mouth of many vertebrate animals, generally used for eating."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "toothbrush",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A brush, used with toothpaste, for cleaning the teeth."
    },
    "difficulty": "EASY"
  },
  {
    "word": "toothpaste",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A paste, normally used with a toothbrush, for cleaning the teeth."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "tornado",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A violent windstorm characterized by a mobile, twisting, funnel-shaped cloud."
    },
    "difficulty": "EASY"
  },
  {
    "word": "tractor",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A vehicle used in farms e.g. for pulling farm equipment and preparing the fields."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "traffic light",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A signalling device positioned at a road intersection or pedestrian crossing to indicate when it may be safe to drive, ride or walk, using a universal colour code."
    },
    "difficulty": "EASY"
  },
  {
    "word": "train",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Elongated portion."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "tree",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Fast growing function based on Kruskal's tree theorem."
    },
    "difficulty": "EASY"
  },
  {
    "word": "triangle",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A polygon with three sides and three angles."
    },
    "difficulty": "EASY"
  },
  {
    "word": "trombone",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A musical instrument in the brass family, having a cylindrical bore, and usually a sliding tube (but sometimes piston valves, and rarely both). Most often refers to the tenor trombone, which is the most common type of trombone and has a fundamental tone of B♭ˌ (contra B♭)."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "truck",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A small wheel or roller, specifically the wheel of a gun carriage."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "trumpet",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A musical instrument of the brass family, generally tuned to the key of B-flat; by extension, any type of lip-vibrated aerophone, most often valveless and not chromatic."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "t-shirt",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A lightweight shirt without buttons, usually with short sleeves and no collar. Often made of cotton and frequently bears a picture or slogan."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "umbrella",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Cloth-covered frame used for protection against rain or sun."
    },
    "difficulty": "EASY"
  },
  {
    "word": "underwear",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Clothes worn next to the skin, underneath outer clothing."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "van",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A covered vehicle used for carrying goods or people, usually roughly cuboid in shape, longer and higher than a car but smaller than a truck/lorry."
    },
    "difficulty": "HARD"
  },
  {
    "word": "vase",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "An upright open container used mainly for displaying fresh, dried, or artificial flowers."
    },
    "difficulty": "EASY"
  },
  {
    "word": "violin",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A musical four-string instrument, generally played with a bow or by plucking the string, with the pitch set by pressing the strings at the appropriate place with the fingers; also any instrument of the violin family."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "washing machine",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A machine, usually automatic, which washes clothes, etc."
    },
    "difficulty": "HARD"
  },
  {
    "word": "watermelon",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A plant of the species Citrullus lanatus, bearing a melon-like fruit."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "waterslide",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A recreational slide with water flowing down it to reduce friction, sometimes involving the participant sitting on a mat or raft and sometimes leading into a pool at the bottom."
    },
    "difficulty": "HARD"
  },
  {
    "word": "whale",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of several species of large sea mammals of the infraorder Cetacea."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "wheel",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A circular device capable of rotating on its axis, facilitating movement or transportation or performing labour in machines."
    },
    "difficulty": "EASY"
  },
  {
    "word": "windmill",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A machine which translates linear motion of wind to rotational motion by means of adjustable vanes called sails."
    },
    "difficulty": "EASY"
  },
  {
    "word": "wine bottle",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A tall bottle with a long neck, normally made of dark or clear glass, for holding and serving wine."
    },
    "difficulty": "EASY"
  },
  {
    "word": "wine glass",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A glass vessel, normally with a stem, from which wine is drunk."
    },
    "difficulty": "EASY"
  },
  {
    "word": "wristwatch",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A watch that is worn on a strap or band fastened around the wrist"
    },
    "difficulty": "HARD"
  },
  {
    "word": "yoga",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of several Hindu or Buddhist disciplines aimed at training the consciousness for a state of perfect spiritual insight and tranquillity; especially a system of exercises practiced to promote control of the body and mind."
    },
    "difficulty": "HARD"
  },
  {
    "word": "zebra",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "Any of three species of genus Equus: E. grevyi, E. quagga, or E. zebra, all with black and white stripes and native to Africa."
    },
    "difficulty": "MEDIUM"
  },
  {
    "word": "zigzag",
    "meaning": {
      "partOfSpeech": "noun",
      "definition": "A line or path that proceeds by sharp turns in alternating directions"
    },
    "difficulty": "MEDIUM"
  }
]